Αντιπαράδειγμα, Αντιθετοαντιστροφή και γράφημα στη διδασκαλία της ανάλυσης Γ΄ λυκείου
Ελευθεριάδης Μάριος	Λόλας Κωνσταντίνος	Ευαγγελόπουλος Αναστάσιος
Μαθηματικός ΔΕ	Μαθηματικός ΔΕ	Σχ. Σύμβουλος Μαθηματικών
marioelef@gmail.com
costasmath@yahoo.gr
kontasos@otenet.gr


Περίληψη
Σε αυτή την εργασία παρουσιάζεται μια εφαρμογή των μεθόδων «αντιπαραδείγματος» και «αντιθετοαντιστροφής» και η προσθετική αξία των γραφημάτων σε δυναμικό περιβάλλον, σε θέματα της διδακτέας ύλης. Σκοπός είναι να βοηθήσουν στην κατανόηση και εμβάθυνση των εννοιών στην Ανάλυση με σύγχρονες παιδαγωγικές μεθόδους.

Abstract
In this paper we present an application of methods on counterexample and counterinverse as well as the adding value of graphs on dynamic enviroment based on teaching curriculum. The objective is to help at deeper understanding of definitions in analysis according to modern educational methods.

Αντιπαράδειγμα
Το αντιπαράδειγμα είναι μια μέθοδος για να δείξουμε ότι μια πρόταση δεν ισχύει. Πρόκειται για μία μέθοδο απόδειξης μιας πρότασης ως ψευδής, είναι ειδική περίπτωση της εις άτοπον απαγωγή και απουσιάζει από τα σχολικά βιβλία μαθηματικών.
Χρησιμοποιείται για να δείξουμε ότι μία πρόταση «$p\left( x \right)$, $\forall x\in A$» είναι ψευδής. Εδώ αναφέρουμε ότι θα δείξουμε ότι : «υπάρχει ${{x}_{0}}\in A$ τέτοιο ώστε η $p\left( {{x}_{0}} \right)$ είναι ψευδής» (ή $\exists {{x}_{0}}\in A:\overline{p\left( {{x}_{0}} \right)}$ είναι αληθής). Το ${{x}_{0}}$ είναι το αντιπαράδειγμα στην πρόταση «$p\left( x \right)$, $\forall x\in A$». Η μέθοδος αυτή χρησιμοποιείται στις επιστήμες για την απόρριψη λανθασμένων εικασιών, ισχυρισμών και γενικεύσεων. Στην διδακτική πράξη μπορεί να άρει παρανοήσεις νοητικούς σχηματισμούς μέσα από γνωστική σύγκρουση και να προσφέρει πεδίο αυτενέργειας και μαθηματικής δραστηριότητας (Lakatos 1976, Freudenthal 1983).
Ο ρόλος των αντιπαραδειγμάτων έχει αναγνωριστεί για τη δημιουργία μιας γνωστικής σύγκρουσης (Klymchuk 2001, Peled & Zaslavsky 1997, Zaslavsky & Ron 1998). Η γνωστική σύγκρουση συντελεί στη γνωστική ανάπτυξη ενός μαθητή. Προκαλείται όταν ένας μαθητής βρίσκεται αντιμέτωπος με μία αντίφαση ή ασυνέπεια στις ιδέες του. Οι μαθητές ενδέχεται να κατέχουν αντικρουόμενες ιδέες οι οποίες, αν δεν αναγνωριστούν, δεν προκαλούν σύγκρουση. Η σύγκρουση μεταξύ πληροφοριών και εμπειριών, χρησιμοποιείται κατά την πρόσληψη νέων πληροφοριών που μπορούν να αντληθούν και έρχονται σε αντίθεση με προηγούμενη γνώση των μαθητών, που συνήθως έχει αποκτηθεί βάσει της εμπειρίας. Τα αντιπαραδείγματα μπορούν να τα χωρίσουμε σε δυο κατηγορίες:
α)	παράδειγμα μεταστροφής (pivotal example) και
β)	παράδειγμα γεφύρωσης (bridging example) (Zazkis & Chernoff 2008)
Ένα παράδειγμα χαρακτηρίζεται ως παράδειγμα μεταστροφής, αν δημιουργεί ένα σημείο μεταστροφής στην γνωστική αντίληψη του εκπαιδευόμενου ή στις προσεγγίσεις επίλυσης του προβλήματος που του παρουσιάζεται. Δηλαδή τα παραδείγματα μεταστροφής βοηθούν τους μαθητές να πετύχουν την εννοιολογική αλλαγή. Αν ένα παράδειγμα βοηθά επιπλέον και στην επίλυση των γνωστικών συγκρούσεων χαρακτηρίζεται ως παράδειγμα μεταστροφής- γεφύρωσης ή απλά γεφύρωσης, γιατί χρησιμεύει ως γέφυρα ανάμεσα στην αρχική/αφελή αντίληψη του μαθητή και στις μαθηματικές έννοιες.
Οι μαθητές συχνά επηρεάζονται από προηγούμενες εμπειρίες και χαρακτηρίζουν τα αντιπαραδείγματα ως εξαιρέσεις. Επίσης πολλές φορές δεν αντιλαμβάνονται τη διαφορά ανάμεσα σε ένα παράδειγμα και ένα αντιπαράδειγμα.
Αντίστροφες προτάσεις.
Αν ισχύει: $\left( {{p}_{1}}\text{  }\!\!\kappa\!\!\text{  }\!\!\alpha\!\!\text{  }\!\!\iota\!\!\text{  }{{p}_{2}} \right)\Rightarrow q$ δεν ισχύει πάντα η $q\Rightarrow \left( {{p}_{1}}\text{  }\!\!\kappa\!\!\text{  }\!\!\alpha\!\!\text{  }\!\!\iota\!\!\text{  }{{p}_{2}} \right)$ ή $\left( q\text{  }\!\!\kappa\!\!\text{  }\!\!\alpha\!\!\text{  }\!\!\iota\!\!\text{  }{{p}_{1}} \right)\Rightarrow {{p}_{2}}$ ή $\left( q\text{  }\!\!\kappa\!\!\text{  }\!\!\alpha\!\!\text{  }\!\!\iota\!\!\text{  }{{p}_{2}} \right)\Rightarrow {{p}_{1}}$.
Στις περισσότερες προτάσεις της μορφής $p\Rightarrow q$, η αντίστροφη πρόταση $q\Rightarrow p$ δεν ισχύει (πάντα). Χρησιμοποιούμε αντιπαράδειγμα για να δείξουμε ότι δεν ισχύει η αντίστροφη της $p\Rightarrow q$.
Ενώ στους ορισμούς έχουμε ισοδύναμες προτάσεις.

Νόμος Αντιθετοαντιστροφής
	\[\begin{align}
  & \left( p\Rightarrow q \right)\Leftrightarrow \left( \overline{q}\Rightarrow \overline{p} \right) \\
 & \left( {{p}_{1}}\,\kappa \alpha \iota \,{{p}_{2}}\Rightarrow q \right)\Leftrightarrow \left( \overline{q}\Rightarrow \overline{{{p}_{1}}}\,\,\,\,\,\overline{{{p}_{2}}} \right)
\end{align}\]
Απόδειξη Συνεπαγωγής \[\left( p\Rightarrow q \right)\] με «αντιθετοαντιστροφή».
Για να αποδείξουμε προτάσεις της μορφής «αν $p$ τότε $q$» ή \[\left( p\Rightarrow q \right)\] αρκεί να αποδείξουμε την ισοδύναμη πρόταση: «Αν (όχι $q$) τότε (όχι $p$)» ή \[\left( \overline{q}\Rightarrow \overline{p} \right)\].
Με τη χρήση του νόμου της αντιθετοαντιστροφής μπορούμε να συζητήσουμε την αλήθεια προτάσεων της ανάλυσης με μία, δύο ή περισσοτερες συνθήκες.
Απόδειξη Ισοδυναμίας \[\left( p\Leftrightarrow q \right)\]
Για να αποδείξουμε προτάσεις της μορφής «$p$ αν και μόνο αν $q$» ή \[\left( p\Leftrightarrow q \right)\] έχουμε τους εξής τρόπους:
1ος τρόπος: Να αποδείξουμε με κάποιο από τους προηγούμενους τρόπους ότι «αν $p$ τότε $q$» (ή \[p\Rightarrow q\]) και «αν $q$ τότε$p$» (ή \[q\Rightarrow p\]).
2ος τρόπος: Να αποδείξουμε ότι $p\Leftrightarrow \cdots \Leftrightarrow r\Leftrightarrow \cdots \Leftrightarrow q$.
Θα παρουσιαστούν ορισμένα παραδείγματα σε θέματα και προτάσεις που συζητάσαμε με τους μαθητές, τα οποία τους βοήθησαν να διευρενήσουν, να κατακτήσουν και να εμβαθύνουν σε γνώση με  αυτενέργεια στη διδακτέα ύλη.
Διάφορα θέματα που παρουσιάζονται
Πρόταση 1.	Αν η $f$ συνεχής τότε η ${{f}^{-1}}$ δεν είναι πάντα συνεχής.
Αντιπαράδειγμα: Η συνάρτηση $f\left( x \right)=\left\{ \begin{array}{*{35}{l}}
   x, & x\in \left[ 0,1 \right]  \\
   x-1, & x\in \left( 2,3 \right)  \\
\end{array} \right.$ είναι συνεχής ενώ η ${{f}^{-1}}\left( x \right)=\left\{ \begin{array}{*{35}{l}}
   x, & x\in \left[ 0,1 \right]  \\
   x+1, & x\in \left( 1,2 \right)  \\
\end{array} \right.$ δεν είναι συνεχής στο $1$.




Πρόταση 2.	Αν η $f$ παραγωγίσιμη, τότε η ${{f}^{-1}}$ δεν είναι πάντα παραγωγίσιμη.
Αντιπαράδειγμα. Η συνάρτηση $f\left( x \right)={{x}^{3}}$ είναι «1-1» και παραγωγίσιμη στο $\mathbb{R}$. Όμως η ${{f}^{-1}}\left( x \right)=\left\{ \begin{array}{*{35}{l}}
   \sqrt[3]{x}, & x\ge 0  \\
   -\sqrt[3]{-x}, & x<0  \\
\end{array} \right.$ δεν είναι παραγωγίσιμη στο 0.
Πρόταση 3.	Αν υπάρχει το όριο $\underset{x\to {{x}_{0}}}{\mathop{\lim }}\,\left[ f\left( x \right)+g\left( x \right) \right]$, τότε δεν υπάρχουν πάντα τα όρια $\underset{x\to {{x}_{0}}}{\mathop{\lim }}\,f\left( x \right)$ και $\underset{x\to {{x}_{0}}}{\mathop{\lim }}\,g\left( x \right)$.
Αντιπαράδειγμα. Για $f\left( x \right)=\frac{1}{{{x}^{2}}}$ και $g\left( x \right)=-\frac{1}{{{x}^{2}}}$ τότε $\underset{x\to 0}{\mathop{\lim }}\,\left[ f\left( x \right)+g\left( x \right) \right]=0$ και $\underset{x\to 0}{\mathop{\lim }}\,f\left( x \right)=+\infty $.
Πρόταση 4.	Αν $\underset{x\to +\infty }{\mathop{\lim }}\,f\left( x \right)=+\infty $, τότε η $f$ δεν είναι πάντα γνησίως αύξουσα στο $+\infty $.
Αντιπαράδειγμα. Η συνάρτηση $f\left( x \right)=\eta \mu x+x$ έχει $\underset{x\to +\infty }{\mathop{\lim }}\,f\left( x \right)=+\infty $, όμως δεν είναι γνησίως αύξουσα στο $+\infty $.
Πρόταση 5.	Αν η $f$ είναι συνεχής στο ${{x}_{0}}$, τότε η $f$ δεν είναι πάντα παραγωγίσιμη στο ${{x}_{0}}$.

Αντιπαράδειγμα. Η συνάρτηση $f\left( x \right)=\left\{ \begin{array}{*{35}{l}}
   \ln x+1, & x>1  \\
   -{{x}^{2}}+2, & x\le 1  \\
\end{array} \right.$ είναι συνεχής στο $1$, όμως δεν είναι παραγωγίσιμη στο $1$.
Πρόταση 6.	Αν η ${{C}_{f}}$ δέχεται εφαπτομένη $\varepsilon $ στο ${{x}_{0}}$, τότε η $\varepsilon $ δεν έχει πάντα μόνο ένα κοινό σημείο με την ${{C}_{f}}$.
Αντιπαράδειγμα. (άσκηση Γ10, σελ. 174-175)

Η συνάρτηση $f\left( x \right)=\left\{ \begin{array}{*{35}{l}}
   {{x}^{2}}\eta \mu \frac{1}{x}, & x\ne 0  \\
   0, & x=0  \\
\end{array} \right.$ είναι παραγωγίσιμη στο $0$ και έχει εφαπτόμενη την $\varepsilon :y=0$ (άξονας $x'x$) που τέμνει την ${{C}_{f}}$ σε άπειρα σημεία (${{x}_{k}}=\frac{1}{k\pi }$, $k\in {{\mathbb{Z}}^{*}}$) παρόλο που εφάπτεται της ${{C}_{f}}$.
Πρόταση 7.	Αν η $f+g$ είναι παραγωγίσιμη στο${{x}_{0}}$, τότε οι $f$, $g$ δεν είναι πάντα παραγωγίσιμες στο ${{x}_{0}}$.

Αντιπαράδειγμα. H συνάρτηση $\left( f+g \right)\left( x \right)=x+1$ είναι παραγωγίσιμη στο $0$, ενώ οι συναρτήσεις $f\left( x \right)=x+\left| x \right|$ και $g\left( x \right)=1-\left| x \right|$ δεν είναι παραγωγίσιμες στο $0$.
Αντιπαράδειγμα. Η συνάρτηση $f\left( x \right)={{x}^{2}}$, $x\in \left( -\infty ,1 \right]$ είναι παραγωγίσιμη στο \[1\], με $f'\left( 1 \right)=2$ και η $g\left( x \right)=-3x$, $x\in \left[ 1,+\infty  \right)$ είναι παραγωγίσιμη στο \[1\], με $g'\left( 1 \right)=-3$ όμως για τη συνάρτηση $f+g$ δεν ορίζεται η παράγωγος στο \[1\].
Πρόταση 8.	Αν η $f\circ g$ δεν είναι παραγωγίσιμη στο ${{x}_{0}}$, τότε δεν είναι πάντα η $g$ παραγωγίσιμη στο ${{x}_{0}}$ ή η $f$ παραγωγίσιμη στο $g\left( {{x}_{0}} \right)$.
Αντιπαράδειγμα. H συνάρτηση $h\left( x \right)=f\left( g\left( x \right) \right)=\ln \left( \sqrt{x}+1 \right)$ με $g\left( x \right)=\sqrt{x}+1$ και $f\left( x \right)=\ln x$ δεν είναι παραγωγίσιμη στο $0$, γιατί δεν είναι παραγωγίσιμη η $g$ στο $0$.
Πρόταση 9.	Aν συνάρτηση $f$ είναι ορισμένη και συνεχής στο $\left[ \alpha ,\beta  \right)$ δεν παρουσιάζει πάντα ακρότατο στο $\alpha $.
Αντιπαράδειγμα. H συνάρτηση ${{f}^{-1}}\left( x \right)=\left\{ \begin{array}{*{35}{l}}
   {{x}^{2}}\eta \mu \frac{1}{x}, & x\ne 0  \\
   0, & x=0  \\
\end{array} \right.$ είναι συνεχής ως γινόμενο συνεχών και σύνθετη συνεχών και στο $0$ είναι συνεχής, $\underset{x\to 0}{\mathop{\lim }}\,\left( {{x}^{2}}\eta \mu \frac{1}{x} \right)=0=f\left( 0 \right)$. Το $f\left( 0 \right)$ δεν είναι τοπικό ακρότατο, γιατί όσο κοντά στο $0$, σε διάστημα της μορφής $\left[ 0,x \right]$ η $f\left( x \right)$ «αλλάζει» πρόσημο.

Πρόταση 10.	Aν η συνάρτηση $f$ είναι ορισμένη στο $\left[ \alpha ,\beta  \right]$, δεν είναι συνεχής στο ${{x}_{0}}\in \left( \alpha ,\beta  \right)$ και και αλλάζει το πρόσημο της $f'$ εκατέρωθεν του ${{x}_{0}}$, τότε δεν παρουσιάζει πάντα ακρότατο στο ${{x}_{0}}$.

Αντιπαράδειγμα. H συνάρτηση $f\left( x \right)=\left\{ \begin{array}{*{35}{l}}
   \sqrt{-x}, & x<0  \\
   {{x}^{2}}+1, & x\ge 0  \\
\end{array} \right.$ δεν είναι συνεχής στο $0$. Είναι γνησίως φθίνουσα στο $\left( -\infty ,0 \right)$ και γνησίως αύξουσα στο $\left( 0,+\infty  \right)$, όμως δε παρουσιάζει τ. ακρότατο στο $0$.
Πρόταση 11.	Αν η ${{C}_{f}}$ μιας συνάρτησης $f$, αλλάζει κυρτότητα εκατέρωθεν του ${{x}_{0}}$, τότε δεν παρουσιάζει πάντα στο ${{x}_{0}}$ σημείο καμπής.
Αντιπαράδειγμα. Έστω η συνάρτηση $f\left( x \right)=\left\{ \begin{array}{*{35}{l}}
   \sqrt{-x}, & x<0  \\
   {{x}^{2}}, & x\ge 0  \\
\end{array} \right.$. Στο ${{x}_{0}}=0$ η κυρτότητα αλλάζει είδος, αφού $f''\left( x \right)=\left\{ \begin{array}{*{35}{l}}
   \frac{1}{4x\sqrt{-x}}, & x<0  \\
   2, & x\ge 0  \\
\end{array} \right.$ (δεν υπάρχει η $f''\left( 0 \right)$, αφού δεν υπάρχει και η $f'\left( 0 \right)$) και $f''\left( 0 \right)<0$ για $x<0$ και $f''\left( 0 \right)>0$ για $x>0$. Στο ${{x}_{0}}=0$ δεν υπάρχει εφαπτομένη και επομένως το ${{x}_{0}}=0$ δεν είναι σημείο καμπής.
Πρόταση 12.	Αν η ${{C}_{f}}$ μιας συνάρτησης $f$, έχει ασύμπτωτη την ευθεία $\varepsilon $, τότε η ${{C}_{f}}$ μπορεί να τέμνει την $\varepsilon $.
Αντιπαράδειγμα. Η συνάρτηση $f\left( x \right)=\left\{ \begin{array}{*{35}{l}}
   \frac{\eta \mu x}{x}, & x\ne 0  \\
   1, & x=0  \\
\end{array} \right.$ είναι συνεχής και $\underset{x\to +\infty }{\mathop{\lim }}\,\frac{\eta \mu x}{x}=0$ και $\underset{x\to -\infty }{\mathop{\lim }}\,\frac{\eta \mu x}{x}=0$, άρα η ευθεία $y=0$ είναι οριζόντια ασύμπτωτη της $f$ (δηλαδή ο άξονας $x'x$). Όμως η εξίσωση $f\left( x \right)=0$ έχει άπειρες λύσεις στο $\mathbb{R}$, άρα ο άξονας $x'x$ και η ${{C}_{f}}$ έχουν άπειρα κοινά σημεία ($x=k\pi $, $k\in \mathbb{Z}$).

Πρόταση 13.	Αντίστροφο Θ. Rolle. Αν η $f$ είναι συνεχής στο $\left[ \alpha ,\beta  \right]$, $f\left( \alpha  \right)=f\left( \beta  \right)$ και υπάρχει ${{x}_{0}}\in \left( \alpha ,\beta  \right)$ τέτοιο ώστε $f'\left( {{x}_{0}} \right)=0$, τότε η $f$ δεν είναι πάντα παραγωγίσιμη στο $\left( \alpha ,\beta  \right)$.
Αντιπαράδειγμα. Η συνάρτηση $f\left( x \right)=\left| {{x}^{2}}-4x \right|$ έχει $f\left( -1 \right)=f\left( 5 \right)=5$ και $f'\left( 2 \right)=0$, αλλά δεν είναι παραγωγίσιμη στο $0$.
Πρόταση 14.	Αν η $f$ είναι παραγωγίσιμη στο $\left( \alpha ,\beta  \right)$, $f\left( \alpha  \right)=f\left( \beta  \right)$ και υπάρχει ${{x}_{0}}\in \left( \alpha ,\beta  \right)$ τέτοιο ώστε $f'\left( x{{ & }_{0}} \right)=0$, τότε η $f$ δεν είναι πάντα συνεχής στο $\left[ \alpha ,\beta  \right]$.
Αντιπαράδειγμα. Η συνάρτηση $f\left( x \right)=\left\{ \begin{array}{*{35}{l}}
   {{x}^{2}}, & x\in \left( -1,2 \right]  \\
   4, & x=-1  \\
\end{array} \right.$  έχει $f\left( -1 \right)=f\left( 2 \right)=4$, $f'\left( 0 \right)=0$, αλλά δεν είναι συνεχής στο ${{x}_{0}}=-1$.

Πρόταση 15.	Αν η $f$ είναι συνεχής στο $\left[ \alpha ,\beta  \right]$, παραγωγίσιμη στο $\left( \alpha ,\beta  \right)$ και υπάρχει ${{x}_{0}}\in \left( \alpha ,\beta  \right)$ τέτοιο ώστε $f'\left( x{{ & }_{0}} \right)=0$, τότε δεν είναι πάντα $f\left( \alpha  \right)=f\left( \beta  \right)$.
Αντιπαράδειγμα. Η συνάρτηση $f\left( x \right)={{x}^{2}}$, $x\in \left[ -1,2 \right]$ είναι παραγωγίσιμη στο $\left( -1,2 \right)$, $f'\left( 0 \right)=0$, αλλά $f\left( -1 \right)\ne f\left( 2 \right)$.
Πρόταση 16.	Αντίστροφο ΘΜΤ. Αν η $f$ είναι συνεχής στο $\left[ \alpha ,\beta  \right]$ και υπάρχει ${{x}_{0}}\in \left( \alpha ,\beta  \right)$ τέτοιο ώστε $f'\left( x{{ & }_{0}} \right)=\frac{f\left( \beta  \right)-f\left( \alpha  \right)}{\beta -\alpha }$, τότε η $f$ δεν είναι πάντα παραγωγίσιμη στο $\left( \alpha ,\beta  \right)$.
Αντιπαράδειγμα.
Πρόταση 17.	Αν η $f$ είναι παραγωγίσιμη στο $\left( \alpha ,\beta  \right)$ και υπάρχει ${{x}_{0}}\in \left( \alpha ,\beta  \right)$ τέτοιο ώστε $f'\left( x{{ & }_{0}} \right)=\frac{f\left( \beta  \right)-f\left( \alpha  \right)}{\beta -\alpha }$, τότε η $f$ δεν είναι πάντα συνεχής στο $\left[ \alpha ,\beta  \right]$.
Αντιπαράδειγμα.
Πρόταση 18.	Αντίστροφο Μονοτονίας. Αν η $f$ είναι συνεχής στο $\left[ \alpha ,\beta  \right]$, παραγωγίσιμη στο $\left( \alpha ,\beta  \right)$ και γνησίως αύξουσα στο $\left[ \alpha ,\beta  \right]$, τότε δεν είναι πάντα $f'\left( x &  \right)>0$, για κάθε $x\in \left( \alpha ,\beta  \right)$.
Αντιπαράδειγμα. Η $f\left( x \right)=x+\eta \mu x$ είναι γνήσια αύξουσα με $f'\left( x \right)=1+\sigma \upsilon \nu x$ που για άπειρες τιμές $x=\left( 2k+1 \right)\pi $, $k\in \mathbb{Z}$ ισχύει $f'\left( x \right)=0$.
Πρόταση 19.	Αν $f'\left( x &  \right)>0$ για κάθε $x\in \left( \alpha ,\beta  \right)$ και $f$ γνησίως αύξουσα στο $\left[ \alpha ,\beta  \right]$, τότε δεν είναι πάντα η $f$ συνεχής στο $\left[ \alpha ,\beta  \right]$.
Αντιπαράδειγμα.
Πρόταση 20.	Αντίστροφο Θ. Fermat. Αν η $f$ είναι παραγωγίσιμη ${{x}_{0}}\in \left( \alpha ,\beta  \right)$, $f'\left( {{x}_{0}} \right)=0$, τότε η $f$ δεν είναι πάντα θέση τ. ακρότατου το ${{x}_{0}}$.
Αντιπαράδειγμα.
Πρόταση 21.	Αν η f έχει θέση τοπ. ακρότατου το ${{x}_{0}}$ και $f'\left( {{x}_{0}} \right)=0$, τότε το ${{x}_{0}}$ δεν είναι πάντα εσωτερικό σημείο διαστήματος.
Αντιπαράδειγμα.
Πρόταση 22.	Αν το \[\underset{x\to xo}{\mathop{\lim }}\,\frac{f\left( x \right)}{g\left( x \right)}=\left( \frac{0}{0} \right)\] ή \[\left( \frac{\pm \infty }{\pm \infty } \right)\] και υπάρχει τότε δεν υπάρχει πάντα το \[\underset{x\to xo}{\mathop{\lim }}\,\frac{f'\left( x \right)}{g'\left( x \right)}\].
Αντιπαράδειγμα. Για $f\left( x \right)={{x}^{2}}\eta \mu \frac{1}{x}$ και $g\left( x \right)=\varepsilon \varphi x$ έχουμε \[\underset{x\to 0}{\mathop{\lim }}\,\frac{{{x}^{2}}\eta \mu \frac{1}{x}}{\varepsilon \varphi x}=\left( \frac{0}{0} \right)=\underset{x\to 0}{\mathop{\lim }}\,\frac{x\eta \mu \frac{1}{x}}{\frac{\eta \mu x}{x}\frac{1}{\sigma \upsilon \nu x}}=0\], αλλά
\[\underset{x\to 0}{\mathop{\lim }}\,\frac{\left( {{x}^{2}}\eta \mu \frac{1}{x} \right)'}{\left( \varepsilon \varphi x \right)'}=\underset{x\to 0}{\mathop{\lim }}\,\frac{2x\text{ }\!\!\eta\!\!\text{  }\!\!\mu\!\!\text{ }\frac{1}{x}-\text{ }\!\!\sigma\!\!\text{  }\!\!\upsilon\!\!\text{  }\!\!\nu\!\!\text{ }\frac{1}{x}}{\frac{1}{\text{ }\!\!\sigma\!\!\text{  }\!\!\upsilon\!\!\text{ }{{\text{ }\!\!\nu\!\!\text{ }}^{2}}x}}=\underset{x\to 0}{\mathop{\lim }}\,\sigma \upsilon {{\nu }^{2}}x\left( 2x\text{ }\!\!\eta\!\!\text{  }\!\!\mu\!\!\text{ }\frac{1}{x}-\text{ }\!\!\sigma\!\!\text{  }\!\!\upsilon\!\!\text{  }\!\!\nu\!\!\text{ }\frac{1}{x} \right)\]

Πρόταση 23.	Αντίστροφο Σ.Κ. Αν η $f$ είναι 2 φορές παραγωγίσιμη  και  $f'\left( {{x}_{0}} \right)=0$, τότε η $f$ δεν είναι πάντα θέση σημείου καμπής.
Αντιπαράδειγμα. Η $f\left( x \right)={{x}^{4}}$, έχει $f'\left( {{x}_{0}} \right)=0$, αλλά το $0$ δεν είναι σημείο καμπής.


Πρόταση 24.	Αντίστροφο Κυρτότητας. Αν η $f$ είναι συνεχής στο $\left[ \alpha ,\beta  \right]$, 2 φορές παραγωγίσιμη στο $\left( \alpha ,\beta  \right)$ και κυρτή στο $\left[ \alpha ,\beta  \right]$, τότε δεν είναι $f''\left( x &  \right)>0$, για κάθε $x\in \left( \alpha ,\beta  \right)$.
Αντιπαράδειγμα. Η $f\left( x \right)={{\left( x-2 \right)}^{4}}+x$ είναι κυρτή αλλά έχει $f''\left( 2 \right)=0$.


Πρόταση 25.	Αν η $f$ είναι παραγωγίσιμη, τότε η $f'$ δεν είναι πάντα συνεχής.
Αντιπαράδειγμα. Η συνάρτηση $f\left( x \right)=\left\{ \begin{array}{*{35}{l}}
   {{x}^{2}}\eta \mu \frac{1}{x}, & x\ne 0  \\
   0, & x=0  \\
\end{array} \right.$ είναι συνεχής στο $\mathbb{R}$, με παράγωγο $f'\left( x \right)=\left\{ \begin{array}{*{35}{l}}
   2x\eta \mu \frac{1}{x}-\sigma \upsilon \nu \frac{1}{x}, & x\ne 0  \\
   0, & x=0  \\
\end{array} \right.$ η οποία δεν είναι συνεχής στο $0$.
Αντιθετοαντιστροφή
Ορισμός «1-1»
Η f λέγεται  «1-1» αν και μόνο αν για κάθε ${{x}_{1}}$, ${{x}_{2}}$ ισχύει ${{x}_{1}}\ne {{x}_{2}}\Rightarrow f\left( {{x}_{1}} \right)\ne f\left( {{x}_{2}} \right)$.
Αντιθετοαντίστροφο του ${{x}_{1}}\ne {{x}_{2}}\Rightarrow f\left( {{x}_{1}} \right)\ne f\left( {{x}_{2}} \right)$ είναι το $f\left( {{x}_{1}} \right)=f\left( {{x}_{2}} \right)\Rightarrow {{x}_{1}}={{x}_{2}}$.
Πρόταση 26.	Αν η $f$ δεν είναι αντιστρέψιμη τότε δεν είναι «1-1».
Απόδειξη με αντιθετοαντιστροφή. Αν ήταν «1-1» τότε θα ήταν αντιστρέψιμη.
Πρόταση 27.	Αν δεν υπάρχει το όριο $\underset{x\to {{x}_{0}}}{\mathop{\lim }}\,\left[ f\left( x \right)+g\left( x \right) \right]$, τότε δεν υπάρχει το $\underset{x\to {{x}_{0}}}{\mathop{\lim }}\,f\left( x \right)$ ή το $\underset{x\to {{x}_{0}}}{\mathop{\lim }}\,g\left( x \right)$.
Απόδειξη με αντιθετοαντιστροφή. Αν υπήρχαν και τα δύο, τότε τα υπήρχε και το $\underset{x\to {{x}_{0}}}{\mathop{\lim }}\,\left[ f\left( x \right)+g\left( x \right) \right]$, ΑΤΟΠΟ.
Πρόταση 28.	Αν η $g\circ f$ δεν είναι συνεχής στο ${{x}_{0}}$, τότε η $f$ δεν είναι συνεχής στο ${{x}_{0}}$ ή η $g$ δεν είναι συνεχής στο $f\left( {{x}_{0}} \right)$.
Απόδειξη με αντιθετοαντιστροφή. Αν η $f$ ήταν συνεχής στο ${{x}_{0}}$ και η $g$ ήταν συνεχής στο $f\left( {{x}_{0}} \right)$ τότε θα ήταν συνεχής και η $g\circ f$, ΑΤΟΠΟ.
Πρόταση 29.	Αν η $f$ δεν έχει ρίζα στο $\left( \alpha ,\beta  \right)$, τότε η $f$ δεν είναι συνεχής στο $\left[ \alpha ,\beta  \right]$ ή  $f\left( \alpha  \right)\cdot f\left( \beta  \right)\ge 0$
Απόδειξη με αντιθετοαντιστροφή. Αν η $f$ ήταν συνεχής στο $\left[ \alpha ,\beta  \right]$ και $f\left( \alpha  \right)\cdot f\left( \beta  \right)<0$ τότε η $f$ έχει ρίζα στο $\left( \alpha ,\beta  \right)$, ΑΤΟΠΟ.
Πρόταση 30.	Αν η $g\circ f$ δεν είναι παραγωγίσιμη στο ${{x}_{0}}$, τότε η $f$ δεν είναι πραγωγίσιμη στο ${{x}_{0}}$ ή η $g$ δεν είναι παραγωγίσιμη στο $f\left( {{x}_{0}} \right)$.
Απόδειξη με αντιθετοαντιστροφή. Αν η $f$ ήταν παραγωγίσιμη στο ${{x}_{0}}$ και η $g$ ήταν παραγωγίσιμη στο $f\left( {{x}_{0}} \right)$ τότε θα ήταν παραγωγίσιμη και η $g\circ f$ στο ${{x}_{0}}$, ΑΤΟΠΟ.
Πρόταση 31.	Αν η $f$ δεν είναι συνεχής στο ${{x}_{0}}$, τότε η $f$ δεν είναι πραγωγίσιμη στο ${{x}_{0}}$.
Απόδειξη με αντιθετοαντιστροφή. Αν η $f$ ήταν παραγωγίσιμη στο ${{x}_{0}}$ τότε θα ήταν και συνεχής στο ${{x}_{0}}$, ΑΤΟΠΟ.
